In [13]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [14]:
file_path = '/Users/hananalaskar/Documents/Code for Girls/data-science/ds-master/' 
df = pd.read_csv(file_path+'data_set/ds_salaries_messy.csv')

In [15]:
df

,work_year,experience_level,employment_type,job_title,salary,salary_currency,employee_residence,remote_ratio,company_location,company_size
0,2022,SE,FT,Research Scientist,85000,EUR,FR,50,FR,L
1,2021,MI,FT,Data Engineer,110000,PLN,PL,100,PL,L
2,2022,MI,FT,Data Engineer,40000,NaN,GB,0,GB,M
3,2022,SE,FT,Data Analyst,132000,USD,US,0,US,M
4,2022,SE,FT,Data Engineer,100000,USD,US,100,US,M
...,...,...,...,...,...,...,...,...,...,...
602,2022,SE,FT,Data Analyst,61300,USD,CA,100,CA,M
603,2022,SE,FT,Data Engineer,54000,USD,US,0,US,M
604,2021,EN,FT,Data Analyst,50000,USD,US,100,US,M
605,2022,SE,FT,Data Scientist,211500,USD,US,100,US,M
606,2021,SE,FT,Principal Data Scientist,147000,EUR,DE,100,DE,M

In [16]:
df.describe()

         work_year        salary  remote_ratio
count   607.000000  6.070000e+02    607.000000
mean   2021.405272  3.240001e+05     71.797364
std       0.692133  1.544357e+06     44.293875
min    2020.000000  4.000000e+03    -10.000000
25%    2021.000000  7.000000e+04     50.000000
50%    2022.000000  1.150000e+05    100.000000
75%    2022.000000  1.650000e+05    100.000000
max    2022.000000  3.040000e+07    296.000000

In [21]:
df['salary'].max()

30400000

In [22]:
df['salary'].min()

4000

In [23]:
df['salary'].mean()

324000.0626029654

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 607 entries, 0 to 606
Data columns (total 10 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           607 non-null    int64
 1   experience_level    605 non-null    object
 2   employment_type     588 non-null    object
 3   job_title           607 non-null    object
 4   salary              607 non-null    int64
 5   salary_currency     595 non-null    object
 6   employee_residence  607 non-null    object
 7   remote_ratio        607 non-null    int64
 8   company_location    607 non-null    object
 9   company_size        607 non-null    object
dtypes: int64(3), object(7)
memory usage: 47.5+ KB

In [19]:
df.loc[df['experience_level'] != df['experience_level']]

,work_year,experience_level,employment_type,job_title,salary,salary_currency,employee_residence,remote_ratio,company_location,company_size
403,2021,NaN,FT,Principal Data Engineer,600000,USD,US,100,US,L
442,2021,NaN,FT,Data Scientist,58000,MXN,MX,0,MX,S

In [20]:
df.loc[df['job_title']  == 'Principal Data Engineer']

,work_year,experience_level,employment_type,job_title,salary,salary_currency,employee_residence,remote_ratio,company_location,company_size
145,2021,SE,FT,Principal Data Engineer,200000,USD,US,100,US,M
353,2021,SE,FT,Principal Data Engineer,185000,USD,US,100,US,L
403,2021,NaN,FT,Principal Data Engineer,600000,USD,US,100,US,L

In [ ]:
df.shape

In [ ]:
df.info()

In [ ]:
## check null values

In [ ]:
df.loc[df['experience_level'] != df['experience_level']]

In [ ]:
## drop them or intefere there values

In [ ]:
df.loc[df['job_title'] == 'Principal Data Engineer']

In [ ]:
df.loc[df['job_title'] == 'Data Scientist']['experience_level'].unique()

In [ ]:
## check data consistency

In [ ]:
import numpy as np
list_ = [1 , 2, 3, 4, 5, 1000]

list_np = np.asarray(list_)

np.sum(list_np)/ list_np.size

In [ ]:
list_np.mean()

In [ ]:
df.describe()

In [ ]:
df['remote_ratio'].unique()

In [ ]:
df['salary'].max()

In [ ]:
df['salary'].min()

In [ ]:
df['salary'].mean()

In [ ]:
df.plot.hist(column=["salary"], bins=1000, figsize=(20, 15))

In [ ]:
df.loc[df['salary'] <  df['salary'].mean()].plot.hist(column=["salary"], bins=1000, figsize=(20, 15))

In [ ]:
df.loc[df['salary'] >  df['salary'].mean()].plot.hist(column=["salary"], bins=1000, figsize=(20, 15))